In [278]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [279]:
df= pd.read_excel("Salary Dataset.xlsx")

In [280]:
df.head()

,Company Name,Job Title,Sample Volunteers Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"9,44,110/yr"

In [281]:
df.shape

(4344, 5)

In [282]:
X=df.loc[:, ['Job Title','Location']]
X.head()

        Job Title   Location
0  Data Scientist  Bangalore
1  Data Scientist  Bangalore
2  Data Scientist  Bangalore
3  Data Scientist  Bangalore
4  Data Scientist  Bangalore

In [283]:
Y=df.loc[:,['Salary']]
Y.head()

         Salary
0   6,48,573/yr
1  11,91,950/yr
2   8,36,874/yr
3   6,69,578/yr
4   9,44,110/yr

In [284]:
np.unique(df[['Job Title']].values)

array(['Associate Machine Learning Engineer', 'Data Analyst',
       'Data Engineer', 'Data Science', 'Data Science Associate',
       'Data Science Consultant', 'Data Science Lead',
       'Data Science Manager', 'Data Scientist',
       'Data Scientist - Trainee', 'Junior Data Scientist',
       'Lead Data Scientist', 'Machine Learning Associate',
       'Machine Learning Consultant', 'Machine Learning Data Analyst',
       'Machine Learning Data Associate',
       'Machine Learning Data Associate I',
       'Machine Learning Data Associate II', 'Machine Learning Developer',
       'Machine Learning Engineer',
       'Machine Learning Engineer/Data Scientist',
       'Machine Learning Scientist', 'Machine Learning Software Engineer',
       'Senior Data Scientist', 'Senior Machine Learning Engineer',
       'Software Engineer - Machine Learning'], dtype=object)

In [285]:
np.unique(df[['Location']].values)

array(['Bangalore', 'Hyderabad', 'Mumbai', 'New Delhi', 'Pune'],
      dtype=object)

In [286]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4344 entries, 0 to 4343
Data columns (total 5 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company Name                4341 non-null   object
 1   Job Title                   4344 non-null   object
 2   Sample Volunteers Reported  4342 non-null   float64
 3   Location                    4344 non-null   object
 4   Salary                      4344 non-null   object
dtypes: float64(1), object(4)
memory usage: 169.8+ KB

In [287]:
df[['Company Name', 'Job Title','Salary']].describe()

                     Company Name       Job Title        Salary
count                        4341            4344          4344
unique                       2529              26          3101
top     Tata Consultancy Services  Data Scientist  12,00,000/yr
freq                           41            1844            24

In [288]:
df.isin(['?']).sum(axis=0)

Company Name                  0
Job Title                     0
Sample Volunteers Reported    0
Location                      0
Salary                        0
dtype: int64

In [289]:
display(df)

,Company Name,Job Title,Sample Volunteers Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"9,44,110/yr"
...,...,...,...,...,...
4339,TaiyÅAI,Machine Learning Scientist,1.0,Mumbai,"5,180/mo"
4340,Decimal Point Analytics,Machine Learning Developer,1.0,Mumbai,"7,51,286/yr"
4341,MyWays,Machine Learning Developer,1.0,Mumbai,"4,10,952/yr"
4342,Market Pulse Technologies,Software Engineer - Machine Learning,1.0,Mumbai,"16,12,324/yr"
4343,vPhrase,Machine Learning Engineer,1.0,Mumbai,"9,39,843/yr"

In [290]:
df['Job Title'].value_counts().nlargest(30)

Data Scientist                              1844
Data Analyst                                 990
Data Engineer                                805
Machine Learning Engineer                    568
Data Science                                  43
Senior Data Scientist                         39
Junior Data Scientist                         18
Senior Machine Learning Engineer               9
Lead Data Scientist                            6
Machine Learning Data Associate II             2
Machine Learning Consultant                    2
Machine Learning Developer                     2
Machine Learning Scientist                     2
Software Engineer - Machine Learning           2
Data Science Associate                         1
Machine Learning Engineer/Data Scientist       1
Data Science Lead                              1
Machine Learning Data Associate                1
Machine Learning Data Associate I              1
Machine Learning Associate                     1
Data Scientist - Trainee                       1
Associate Machine Learning Engineer            1
Machine Learning Data Analyst                  1
Data Science Manager                           1
Data Science Consultant                        1
Machine Learning Software Engineer             1
Name: Job Title, dtype: int64

In [291]:
def title_seniority(title):
    if 'sr.' in title.lower() or 'senior' in title.lower() or 'lead' in title.lower() or 'principal' in title.lower():
            return 'sr'
    elif 'junior' in title.lower() or 'jr.' in title.lower():
        return 'jr'
    else:
        return 'other'

df['job_seniority'] = df['Job Title'].apply(title_seniority)
df['job_seniority'].value_counts()

other    4271
sr         55
jr         18
Name: job_seniority, dtype: int64

In [292]:
salary = df['Salary'].apply(lambda x: x.split("(")[0])
salary

0        6,48,573/yr
1       11,91,950/yr
2        8,36,874/yr
3        6,69,578/yr
4        9,44,110/yr
            ...
4339        5,180/mo
4340     7,51,286/yr
4341     4,10,952/yr
4342    16,12,324/yr
4343     9,39,843/yr
Name: Salary, Length: 4344, dtype: object

In [293]:
print("Length of Salary: ",len(salary.unique()))
salary.unique()[450:]

Length of Salary:  3101

array(['85,643/mo', '42,82,144/yr', '13,81,355/yr', ..., '7,51,286/yr',
       '4,10,952/yr', '9,39,843/yr'], dtype=object)

In [294]:
df['Salary'].apply(lambda x : x[1]).unique()

array([',', '1', '6', '3', '4', '5', '2', '7', '0', '8', '9', '£', 'F'],
      dtype=object)

In [300]:
df[df['Salary'].apply(lambda x : x[1]) == '£']

,Company Name,Job Title,Sample Volunteers Reported,Location,Salary,job_seniority
585,MiQ,Data Scientist,1.0,Bangalore,"Â£16,74,802/yr",other
1054,Tata Consultancy Services,Data Scientist,1.0,Pune,"Â£7,03,427/yr",other
1070,WNS,Data Scientist,1.0,Pune,"Â£2,05,049/yr",other
1115,Saama Technologies,Data Scientist,1.0,Pune,"Â£9,34,857/yr",other
3285,Datametica,Data Engineer,1.0,Pune,"Â£10,15,458/yr",other
3407,Cognizant Technology Solutions,Data Engineer,1.0,Hyderabad,"Â£1,00,000/mo",other

In [305]:
salary = salary.apply(lambda x: x if type(x)== type(3.5) else x.replace(',','').replace('/yr', '').replace('/mo', ' Permonth').replace('/hr', ' Perhour').replace('£', '').replace('FN', ''))
salary

0              648573
1             1191950
2              836874
3              669578
4              944110
            ...
4339    5180 Permonth
4340           751286
4341           410952
4342          1612324
4343           939843
Name: Salary, Length: 4344, dtype: object

In [307]:
def convertsalaryfir(salary):
    Currency = salary[0] 
    freq = salary.split('/')[-1] 
    csalary = float(salary.split('/')[0][1:].replace(',', '').replace('£', '').replace('FN', ''))
    
    if Currency=='$':
        csalary*=81
    elif Currency=='A':
        csalary*=0.92
    elif Currency=='Â':
        csalary*=97
    
    # converting salary from monthly to yearly
    
    if freq=='mo':
        csalary*=12
    elif freq=='hr':
        csalary*=1920  # assuming a person works 8 hour a day for 5 days a week; 8*5=40; 40*48=1920

    return salary

In [308]:
df['Salary(in Rs/yr)']= df['Salary'].apply(convertsalary)
df.drop('Salary', axis=1, inplace=True)

ValueError: could not convert string to float: '£1674802'